package homework_05_09_2022;

public class Task10 {
    //Есть одномерный массив, заполненный случайными числами. На основании данных этого массива нужно:
    //■ Создать одномерный массив, содержащий только четные числа из первого массива;
    //■ Создать одномерный массив, содержащий только нечетные числа из первого массива;
    //■ Создать одномерный массив, содержащий только отрицательные числа из первого массива;
    //■ Создать одномерный массив, содержащий только положительные числа из первого массива
    public static void main(String[] args) {

    }

}
