public class Task1 {
//main - идентификатор main () зарезервирован для метода, с которого начинается выполнение программы.
// Имя main обозначает метод, который автоматически вызывается операционной системой при запуске программы.
// Следовательно, работа любой программы начинается с выполнения тела метода main().
        public static void main(String[] args) {
            int age1 = 35;
            int data1 = 3;
            int qtu1 = 2;
            double age2 = 1.6;
            double age3 = 1.4;

            System.out.println("Привет! Меня зовут   , мне "+ age1 + " лет. Я учусь в IT-STEP с июня 2022 года, то есть уже "+ data1 + " месяца. У меня есть " + qtu1 + " прекрасных собаки породы   . Старшую зовут  , ей " + age2 + ". Младшую зовут   , она младше ровно на 2 месяца, то есть ей " + age3 + "." );
        }











}
